{
  "architectures": [
    "Qwen2_5OmniForConditionalGeneration"
  ],
  "dtype": "bfloat16",
  "enable_audio_output": true,
  "enable_talker": true,
  "hidden_size": 3584,
  "keys_to_ignore_at_inference": [
    "past_key_values",
    "hidden_states",
    "attention_mask"
  ],
  "model_type": "qwen2_5_omni",
  "talker_config": {
    "_attn_implementation_autoset": true,
    "_name_or_path": "Qwen2.5-Omni-7B/talker",
    "architectures": [
      "Qwen2OmniTalkerForConditionalGeneration"
    ],
    "attention_dropout": 0.0,
    "audio_end_token_id": 151648,
    "audio_start_token_id": 151647,
    "audio_token_index": 151646,
    "dtype": "bfloat16",
    "embedding_size": 3584,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 896,
    "image_token_index": 151655,
    "init_std": 0.02,
    "initializer_range": 0.02,
    "intermediate_size": 18944,
    "layer_types": [
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention",
      "full_attention"
    ],
    "max_position_embeddings": 32768,
    "max_window_layers": 28,
    "model_type": "qwen2_5_omni_talker",
    "num_attention_heads": 12,
    "num_hidden_layers": 24,
    "num_key_value_heads": 4,
    "pad_token_id": null,
    "position_id_per_seconds": 25,
    "rms_norm_eps": 1e-06,
    "rope_parameters": {
      "mrope_section": [
        16,
        24,
        24
      ],
      "rope_theta": 1000000.0,
      "rope_type": "default",
      "type": "default"
    },
    "seconds_per_chunk": 2,
    "sliding_window": null,
    "spatial_merge_size": 2,
    "tie_word_embeddings": false,
    "tts_codec_end_token_id": 8294,
    "tts_codec_mask_token_id": 8296,
    "tts_codec_pad_token_id": 8292,
    "tts_codec_start_token_id": 8293,
    "tts_text_end_token_id": 151861,
    "tts_text_pad_token_id": 151859,
    "tts_text_start_token_id": 151860,
    "use_cache": true,
    "use_sliding_window": false,
    "video_token_index": 151656,
    "vision_end_token_id": 151653,
    "vision_start_token_id": 151652,
    "vocab_size": 8448
  },
  "thinker_config": {
    "_attn_implementation_autoset": true,
    "_name_or_path": "Qwen2.5-Omni-7B/thinker",
    "architectures": [
      "Qwen2OmniNaViTThinkerForConditionalGeneration"
    ],
    "audio_config": {
      "_attn_implementation_autoset": true,
      "_name_or_path": "",
      "activation_dropout": 0.0,
      "activation_function": "gelu",
      "add_cross_attention": false,
      "architectures": null,
      "attention_dropout": 0.0,
      "bos_token_id": null,
      "chunk_size_feed_forward": 0,
      "cross_attention_hidden_size": null,
      "d_model": 1280,
      "decoder_start_token_id": null,
      "dropout": 0.0,
      "dtype": "bfloat16",
      "encoder_attention_heads": 20,
      "encoder_ffn_dim": 5120,
      "encoder_layerdrop": 0.0,
      "encoder_layers": 32,
      "eos_token_id": null,
      "finetuning_task": null,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "init_std": 0.02,
      "initializer_range": 0.02,
      "is_decoder": false,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "max_source_positions": 1500,
      "model_type": "qwen2_5_omni_audio_encoder",
      "n_window": 100,
      "num_mel_bins": 128,
      "output_attentions": false,
      "output_dim": 3584,
      "output_hidden_states": false,
      "pad_token_id": null,
      "prefix": null,
      "problem_type": null,
      "pruned_heads": {},
      "return_dict": true,
      "scale_embedding": false,
      "sep_token_id": null,
      "task_specific_params": null,
      "tf_legacy_loss": false,
      "tie_encoder_decoder": false,
      "tie_word_embeddings": true,
      "tokenizer_class": null,
      "torchscript": false,
      "use_bfloat16": false
    },
    "audio_end_token_id": 151648,
    "audio_start_token_id": 151647,
    "audio_token_index": 151646,
    "bos_token_id": 151644,
    "dtype": "bfloat16",
    "eos_token_id": 151645,
    "ignore_index": -100,
    "image_token_index": 151655,
    "init_std": 0.02,
    "initializer_range": 0.02,
    "model_type": "qwen2_5_omni_thinker",
    "pad_token_id": 151643,
    "position_id_per_seconds": 25,
    "seconds_per_chunk": 2,
    "text_config": {
      "_name_or_path": "",
      "architectures": null,
      "attention_dropout": 0.0,
      "bos_token_id": null,
      "chunk_size_feed_forward": 0,
      "dtype": "bfloat16",
      "eos_token_id": null,
      "hidden_act": "silu",
      "hidden_size": 3584,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "init_std": 0.02,
      "initializer_range": 0.02,
      "intermediate_size": 18944,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "layer_types": [
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention",
        "full_attention"
      ],
      "max_position_embeddings": 32768,
      "max_window_layers": 28,
      "model_type": "qwen2_5_omni_text",
      "num_attention_heads": 28,
      "num_hidden_layers": 28,
      "num_key_value_heads": 4,
      "output_attentions": false,
      "output_hidden_states": false,
      "pad_token_id": 151643,
      "problem_type": null,
      "return_dict": true,
      "rms_norm_eps": 1e-06,
      "rope_parameters": {
        "mrope_section": [
          16,
          24,
          24
        ],
        "rope_theta": 1000000.0,
        "rope_type": "default",
        "type": "default"
      },
      "sliding_window": null,
      "tie_word_embeddings": false,
      "use_cache": true,
      "use_sliding_window": false,
      "vocab_size": 152064
    },
    "tie_word_embeddings": false,
    "user_token_id": 872,
    "video_token_index": 151656,
    "vision_config": {
      "_attn_implementation_autoset": true,
      "_name_or_path": "",
      "add_cross_attention": false,
      "architectures": null,
      "bos_token_id": null,
      "chunk_size_feed_forward": 0,
      "cross_attention_hidden_size": null,
      "decoder_start_token_id": null,
      "depth": 32,
      "dtype": "bfloat16",
      "embed_dim": 1280,
      "eos_token_id": null,
      "finetuning_task": null,
      "fullatt_block_indexes": [
        7,
        15,
        23,
        31
      ],
      "hidden_act": "silu",
      "hidden_size": 1280,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "in_channels": 3,
      "in_chans": 3,
      "init_std": 0.02,
      "initializer_range": 0.02,
      "intermediate_size": 3420,
      "is_decoder": false,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "model_type": "qwen2_5_omni_vision_encoder",
      "num_heads": 16,
      "out_hidden_size": 3584,
      "output_attentions": false,
      "output_hidden_states": false,
      "pad_token_id": null,
      "patch_size": 14,
      "prefix": null,
      "problem_type": null,
      "pruned_heads": {},
      "return_dict": true,
      "sep_token_id": null,
      "spatial_merge_size": 2,
      "spatial_patch_size": 14,
      "task_specific_params": null,
      "temporal_patch_size": 2,
      "tf_legacy_loss": false,
      "tie_encoder_decoder": false,
      "tie_word_embeddings": true,
      "tokenizer_class": null,
      "tokens_per_second": 25,
      "torchscript": false,
      "use_bfloat16": false,
      "window_size": 112
    },
    "vision_end_token_id": 151653,
    "vision_start_token_id": 151652,
    "vision_token_id": 151654
  },
  "token2wav_config": {
    "_attn_implementation_autoset": true,
    "bigvgan_config": {
      "_attn_implementation_autoset": true,
      "_name_or_path": "",
      "add_cross_attention": false,
      "architectures": null,
      "bos_token_id": null,
      "chunk_size_feed_forward": 0,
      "cross_attention_hidden_size": null,
      "decoder_start_token_id": null,
      "dtype": null,
      "eos_token_id": null,
      "finetuning_task": null,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "is_decoder": false,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "mel_dim": 80,
      "model_type": "qwen2_5_omni_bigvgan",
      "output_attentions": false,
      "output_hidden_states": false,
      "pad_token_id": null,
      "prefix": null,
      "problem_type": null,
      "pruned_heads": {},
      "resblock_dilation_sizes": [
        [
          1,
          3,
          5
        ],
        [
          1,
          3,
          5
        ],
        [
          1,
          3,
          5
        ]
      ],
      "resblock_kernel_sizes": [
        3,
        7,
        11
      ],
      "return_dict": true,
      "sep_token_id": null,
      "task_specific_params": null,
      "tf_legacy_loss": false,
      "tie_encoder_decoder": false,
      "tie_word_embeddings": true,
      "tokenizer_class": null,
      "torchscript": false,
      "upsample_initial_channel": 1536,
      "upsample_kernel_sizes": [
        11,
        7,
        4,
        4,
        4,
        4
      ],
      "upsample_rates": [
        5,
        3,
        2,
        2,
        2,
        2
      ],
      "use_bfloat16": false,
      "use_bias_at_final": false
    },
    "dit_config": {
      "_attn_implementation_autoset": true,
      "_name_or_path": "",
      "add_cross_attention": false,
      "architectures": null,
      "block_size": 24,
      "bos_token_id": null,
      "chunk_size_feed_forward": 0,
      "cross_attention_hidden_size": null,
      "decoder_start_token_id": null,
      "depth": 22,
      "dim": 1024,
      "dropout": 0.1,
      "dtype": "float32",
      "emb_dim": 512,
      "enc_attention_channels": 64,
      "enc_channels": [
        256,
        256,
        256,
        256,
        768
      ],
      "enc_dilations": [
        1,
        2,
        3,
        4,
        1
      ],
      "enc_dim": 128,
      "enc_emb_dim": 192,
      "enc_global_context": true,
      "enc_kernel_sizes": [
        5,
        3,
        3,
        3,
        1
      ],
      "enc_lin_neurons": 192,
      "enc_res2net_scale": 2,
      "enc_se_channels": 64,
      "eos_token_id": null,
      "ff_mult": 2,
      "finetuning_task": null,
      "head_dim": 64,
      "heads": 16,
      "hidden_size": 1024,
      "id2label": {
        "0": "LABEL_0",
        "1": "LABEL_1"
      },
      "is_decoder": false,
      "is_encoder_decoder": false,
      "label2id": {
        "LABEL_0": 0,
        "LABEL_1": 1
      },
      "look_ahead_layers": [
        10
      ],
      "look_backward_layers": [
        0,
        20
      ],
      "max_position_embeddings": 32768,
      "mel_dim": 80,
      "model_type": "qwen2_5_omni_dit",
      "num_attention_heads": 16,
      "num_embeds": 8193,
      "num_hidden_layers": 22,
      "output_attentions": false,
      "output_hidden_states": false,
      "pad_token_id": null,
      "prefix": null,
      "problem_type": null,
      "pruned_heads": {},
      "repeats": 2,
      "return_dict": true,
      "rope_parameters": {
        "rope_theta": 10000.0,
        "rope_type": "default"
      },
      "sep_token_id": null,
      "task_specific_params": null,
      "tf_legacy_loss": false,
      "tie_encoder_decoder": false,
      "tie_word_embeddings": true,
      "tokenizer_class": null,
      "torchscript": false,
      "use_bfloat16": false
    },
    "dtype": "bfloat16",
    "model_type": "qwen2_5_omni_token2wav"
  },
  "transformers_version": "5.12.1"
}
