{
  "add_prefix_space": false,
  "audio_bos_token": "<|audio_bos|>",
  "audio_eos_token": "<|audio_eos|>",
  "audio_token": "<|AUDIO|>",
  "backend": "tokenizers",
  "bos_token": null,
  "clean_up_tokenization_spaces": false,
  "eos_token": "<|im_end|>",
  "errors": "replace",
  "image_token": "<|IMAGE|>",
  "is_local": true,
  "local_files_only": false,
  "model_max_length": 32768,
  "model_specific_special_tokens": {
    "audio_bos_token": "<|audio_bos|>",
    "audio_eos_token": "<|audio_eos|>",
    "audio_token": "<|AUDIO|>",
    "image_token": "<|IMAGE|>",
    "video_token": "<|VIDEO|>",
    "vision_bos_token": "<|vision_bos|>",
    "vision_eos_token": "<|vision_eos|>"
  },
  "pad_token": "<|endoftext|>",
  "processor_class": "Qwen2_5OmniProcessor",
  "split_special_tokens": false,
  "tokenizer_class": "Qwen2Tokenizer",
  "unk_token": null,
  "video_token": "<|VIDEO|>",
  "vision_bos_token": "<|vision_bos|>",
  "vision_eos_token": "<|vision_eos|>"
}
